{
  "activation": "silu",
  "add_lm_hidden_dense_layer": true,
  "add_token_type_embeddings": false,
  "architectures": [
    "MegaForSequenceClassification"
  ],
  "attention_activation": "softmax",
  "attention_probs_dropout_prob": 0.1,
  "bidirectional": true,
  "bos_token_id": 0,
  "chunk_size": -1,
  "classifier_dropout": null,
  "dropout_prob": 0.1,
  "ema_beta_range": 0.02,
  "ema_delta_alpha_range": 0.2,
  "ema_gamma_omega_range": 1.0,
  "ema_projection_size": 16,
  "eos_token_id": 2,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4"
  },
  "initializer_range": 0.02,
  "intermediate_size": 256,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4
  },
  "max_positions": 14000,
  "model_type": "mega",
  "nffn_activation_dropout_prob": 0.1,
  "nffn_hidden_size": 256,
  "norm_affine": true,
  "normalization_type": "scalenorm",
  "normalize_before_ffn": true,
  "normalize_before_mega": true,
  "num_attention_heads": 1,
  "num_hidden_layers": 2,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "relative_positional_bias": "rotary",
  "shared_representation_size": 64,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "truncation": null,
  "type_vocab_size": 2,
  "use_cache": true,
  "use_chunking": false,
  "use_feature_dropout": false,
  "use_normalized_ffn": true,
  "vocab_size": 11
}
